-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2013 年 04 月 05 日 17:18
-- 服务器版本: 5.5.24-log
-- PHP 版本: 5.4.3

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `da_crm`
--
CREATE DATABASE `da_crm` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `da_crm`;

-- --------------------------------------------------------

--
-- 表的结构 `crm_cst2user`
--

CREATE TABLE IF NOT EXISTS `crm_cst2user` (
  `c2u_id` int(10) NOT NULL AUTO_INCREMENT COMMENT '客户映射员工id',
  `c2u_cid` int(10) NOT NULL COMMENT '客户id',
  `c2u_puid` int(10) NOT NULL COMMENT '员工id',
  PRIMARY KEY (`c2u_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='客户、员工映射表' AUTO_INCREMENT=25 ;

--
-- 转存表中的数据 `crm_cst2user`
--

INSERT INTO `crm_cst2user` (`c2u_id`, `c2u_cid`, `c2u_puid`) VALUES
(1, 2, 1),
(12, 21, 1),
(13, 22, 1),
(14, 23, 3),
(15, 5, 1),
(16, 16, 1),
(17, 13, 1),
(18, 14, 1),
(19, 17, 1),
(20, 15, 1),
(21, 18, 1),
(22, 20, 3),
(23, 7, 3),
(24, 6, 1);

-- --------------------------------------------------------

--
-- 表的结构 `crm_customer`
--

CREATE TABLE IF NOT EXISTS `crm_customer` (
  `c_id` int(10) NOT NULL AUTO_INCREMENT COMMENT '客户id',
  `c_name` varchar(500) NOT NULL COMMENT '客户名称',
  `c_type` varchar(100) NOT NULL COMMENT '客户分类',
  `c_source` varchar(100) NOT NULL COMMENT '客户来源',
  `c_level` varchar(100) NOT NULL COMMENT '客户等级',
  `c_addr` varchar(1000) NOT NULL COMMENT '客户地址',
  `c_telephone` varchar(100) NOT NULL COMMENT '客户电话',
  `c_email` varchar(100) NOT NULL COMMENT '客户电子邮箱',
  `c_website` varchar(1000) NOT NULL COMMENT '客户官方网址',
  `c_fax` varchar(100) NOT NULL COMMENT '客户传真',
  `c_phone` varchar(100) NOT NULL COMMENT '客户手机',
  `c_user` varchar(50) NOT NULL COMMENT '客户负责人',
  `c_qq` varchar(200) NOT NULL COMMENT '客户qq号码',
  `c_trade` varchar(500) NOT NULL COMMENT '客户行业',
  `c_createpuid` int(10) NOT NULL COMMENT '创建人id',
  `c_createpuname` varchar(50) NOT NULL COMMENT '创建人名称',
  `c_createdate` datetime NOT NULL COMMENT '注册日期',
  `c_remark` text NOT NULL COMMENT '备注',
  PRIMARY KEY (`c_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='客户基本信息表' AUTO_INCREMENT=24 ;

--
-- 转存表中的数据 `crm_customer`
--

INSERT INTO `crm_customer` (`c_id`, `c_name`, `c_type`, `c_source`, `c_level`, `c_addr`, `c_telephone`, `c_email`, `c_website`, `c_fax`, `c_phone`, `c_user`, `c_qq`, `c_trade`, `c_createpuid`, `c_createpuname`, `c_createdate`, `c_remark`) VALUES
(1, '12321321321', '潜在客户', '网络', 'A', '', '13632321', '', '', '', '', '321321321', '', '', 0, '', '0000-00-00 00:00:00', ''),
(2, '成都立德粉', '潜在客户', '网络', 'A', '', '13688387776', '', '', '', '13688387776', '徐某某', '', '', 0, '', '0000-00-00 00:00:00', ''),
(3, '成都23房管局', '意向客户', '电话', 'B', '', '33224432', '', '', '', '', '王正月', '', '', 0, '', '0000-00-00 00:00:00', ''),
(4, '上海烟草集团有限公司', '意向客户', '电话', 'B', '上海浦东', '13688473223', 'dannyxu100@163.com', 'http://www.shanghai.com', '9998324', '13877223332', '王副总', '8233922', '', 0, '', '0000-00-00 00:00:00', '中南海烟草老总，惹不起。'),
(5, '广州市佰健生物工程有限公司', '意向客户', '客户推荐', 'A', '广州市天河区珠江新城双城国际大厦A幢2305房', '13549944423', 'kangcheng@139.com', 'http://www.by-health.com', '77383442', '13632244723', '周总', '889923', '', 0, '', '0000-00-00 00:00:00', '汤臣倍健'),
(6, '百威（中国）销售有限公司', '潜在客户', '朋友介绍', 'C', '武汉市汉阳区琴断口上首', '40061112', '', 'http://genuine.com', '', '', '肖晓鹤', '', '旅游、餐饮、娱乐、休闲、购物', 1, '徐飞', '2013-04-05 12:22:27', ''),
(7, '成都新希臣药业有限公司', '潜在客户', '电话', 'E', '成都市浦江县寿安镇石鱼沱', '85134556', '', '', '', '', '席喜平', '', '医疗保健、社会福利', 1, '徐飞', '2013-04-05 12:37:24', '可以联系一下，有可能做优化'),
(8, '123213', '潜在客户', '网络', 'A', '21321321321', '55555323', '', '', '', '', '32131', '', '保险', 1, '徐飞', '2013-04-05 12:40:39', ''),
(9, '3213434343', '潜在客户', '网络', 'A', '434343434', '24324324', '', '', '', '', '3243243', '', '保险', 1, '徐飞', '2013-04-05 12:41:35', ''),
(10, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:44:46', ''),
(11, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:44:48', ''),
(12, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:44:58', ''),
(13, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:44:59', ''),
(14, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:44:59', ''),
(15, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:44:59', ''),
(16, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:45:00', ''),
(17, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:45:00', ''),
(18, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:45:04', ''),
(19, '321321321', '潜在客户', '网络', 'A', '3432432', '43243243', '', '', '', '', '4324324', '', '保险', 1, '徐飞', '2013-04-05 12:45:04', ''),
(20, '3216565656565', '潜在客户', '网络', 'A', '6565656', '65656565', '', '', '', '', '656565', '', '保险', 1, '徐飞', '2013-04-05 12:46:25', ''),
(21, '3213213213', '潜在客户', '网络', 'A', '213232132', '22244422', '', '', '', '', '32132', '', '保险', 1, '徐飞', '2013-04-05 12:47:54', ''),
(22, 'fdsfdsfd', '潜在客户', '网络', 'A', 'fdsfdsfds ', '32132133', '', '', '', '', '123213', '', '保险', 1, '徐飞', '2013-04-05 12:48:25', ''),
(23, '广州王老吉药业股份有限公司食品饮料分公司（A）', '潜在客户', '网络', 'B', '广州市白云区广花二路831号', '40023302', '', '', '', '', '李经理', '', '保险', 3, '张凯', '2013-04-05 14:39:30', '');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
