/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50045
Source Host           : localhost:3306
Source Database       : da_workflow

Target Server Type    : MYSQL
Target Server Version : 50045
File Encoding         : 65001

Date: 2013-04-06 22:35:21
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for `w_arc`
-- ----------------------------
DROP TABLE IF EXISTS `w_arc`;
CREATE TABLE `w_arc` (
  `a_id` int(10) NOT NULL auto_increment COMMENT '工作流向弧id',
  `a_name` varchar(50) NOT NULL COMMENT '向弧名称（路由名称）',
  `a_wfid` int(10) NOT NULL COMMENT '工作流id',
  `a_sort` int(10) NOT NULL COMMENT '排序',
  `a_pid` int(10) NOT NULL COMMENT '向弧链接库所id',
  `a_tid` int(10) NOT NULL COMMENT '向弧链接变迁id',
  `a_direction` varchar(20) NOT NULL COMMENT '向弧走向；IN：库所走向事务变迁；OUT：事务变迁走向库所',
  `a_type` varchar(20) NOT NULL COMMENT '向弧类型；（分支或汇聚类型）SEQ：一般顺序流类型；Explicit Or Split：显示条件分支；Implicit Or Split：隐式条件分支； Or Join：条件汇聚（显示和隐式）；And Split：并行分支； And Join：并行汇聚',
  `a_precondition` text NOT NULL COMMENT '只有当a_type为Explicit Or Split时有效，这个包含了我们知道的值只有true或false的guard表达式。',
  PRIMARY KEY  (`a_id`)
) ENGINE=MyISAM AUTO_INCREMENT=33 DEFAULT CHARSET=utf8 COMMENT='工作流向弧表';

-- ----------------------------
-- Records of w_arc
-- ----------------------------
INSERT INTO w_arc VALUES ('1', '填写假事单', '7', '1', '1', '3', 'IN', 'SEQ', '');
INSERT INTO w_arc VALUES ('2', '提交', '7', '5', '9', '3', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('3', '总监接收', '7', '15', '9', '1', 'IN', 'SEQ', '');
INSERT INTO w_arc VALUES ('4', '通过', '7', '20', '10', '1', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('5', '总经理接收', '7', '25', '10', '2', 'IN', 'SEQ', '');
INSERT INTO w_arc VALUES ('6', '通过', '7', '30', '2', '2', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('7', '创建企业建站单', '15', '1', '25', '5', 'IN', 'SEQ', '');
INSERT INTO w_arc VALUES ('8', '确定立项', '15', '10', '28', '5', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('9', '接单', '15', '20', '28', '14', 'IN', 'SEQ', '');
INSERT INTO w_arc VALUES ('19', '通过', '15', '50', '29', '7', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('20', '切片完成', '15', '70', '29', '16', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('23', '通过', '15', '999', '27', '8', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('24', '编程完成', '15', '80', '27', '15', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('25', '项目竣工', '15', '999', '26', '9', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('28', '接单', '15', '70', '29', '15', 'IN', 'SEQ', '');
INSERT INTO w_arc VALUES ('29', '接单', '15', '90', '27', '9', 'IN', 'SEQ', '');
INSERT INTO w_arc VALUES ('30', '设计完成', '15', '60', '37', '14', 'OUT', 'SEQ', '');
INSERT INTO w_arc VALUES ('31', '接单', '15', '65', '37', '16', 'IN', 'SEQ', '');

-- ----------------------------
-- Table structure for `w_place`
-- ----------------------------
DROP TABLE IF EXISTS `w_place`;
CREATE TABLE `w_place` (
  `p_id` int(10) NOT NULL auto_increment COMMENT '库所id',
  `p_wfid` int(10) NOT NULL COMMENT '工作流id',
  `p_name` varchar(50) NOT NULL COMMENT '库所名称',
  `p_sort` int(10) NOT NULL COMMENT '排序',
  `p_type` varchar(20) NOT NULL COMMENT '库所类型；1：开始库所；50：中间库所；999：结束库所（当创建了一个新的工作流程时，会自动创建一个开始库所和结束库所）',
  `p_remark` text NOT NULL COMMENT '备注',
  PRIMARY KEY  (`p_id`)
) ENGINE=MyISAM AUTO_INCREMENT=38 DEFAULT CHARSET=utf8 COMMENT='工作流库节点表';

-- ----------------------------
-- Records of w_place
-- ----------------------------
INSERT INTO w_place VALUES ('1', '7', '开始', '0', '1', '');
INSERT INTO w_place VALUES ('2', '7', '结束', '9999', '999', '');
INSERT INTO w_place VALUES ('9', '7', '所属部门经理', '1', '50', '');
INSERT INTO w_place VALUES ('10', '7', '所属部门总监', '10', '50', '');
INSERT INTO w_place VALUES ('11', '11', '开始', '0', '1', '');
INSERT INTO w_place VALUES ('12', '11', '结束', '9999', '999', '');
INSERT INTO w_place VALUES ('13', '0', '开始', '0', '1', '');
INSERT INTO w_place VALUES ('14', '0', '结束', '9999', '999', '');
INSERT INTO w_place VALUES ('15', '14', '开始', '0', '1', '');
INSERT INTO w_place VALUES ('16', '14', '结束', '9999', '999', '');
INSERT INTO w_place VALUES ('19', '12', '开始', '0', '1', '');
INSERT INTO w_place VALUES ('20', '12', '结束', '9999', '999', '');
INSERT INTO w_place VALUES ('21', '13', '开始', '0', '1', '');
INSERT INTO w_place VALUES ('22', '13', '结束', '9999', '999', '');
INSERT INTO w_place VALUES ('25', '15', '开始', '0', '1', '');
INSERT INTO w_place VALUES ('26', '15', '结束', '9999', '999', '');
INSERT INTO w_place VALUES ('27', '15', '技术总监', '40', '50', '');
INSERT INTO w_place VALUES ('28', '15', '设计师', '10', '50', '');
INSERT INTO w_place VALUES ('29', '15', '程序员', '30', '50', '');
INSERT INTO w_place VALUES ('30', '16', '开始', '0', '1', '');
INSERT INTO w_place VALUES ('31', '16', '结束', '9999', '999', '');
INSERT INTO w_place VALUES ('32', '17', '开始', '0', '1', '');
INSERT INTO w_place VALUES ('33', '17', '结束', '9999', '999', '');
INSERT INTO w_place VALUES ('35', '15', '首席设计师', '15', '50', '');
INSERT INTO w_place VALUES ('36', '15', '高级软件工程师', '35', '50', '');
INSERT INTO w_place VALUES ('37', '15', '切片师', '20', '50', '');

-- ----------------------------
-- Table structure for `w_token`
-- ----------------------------
DROP TABLE IF EXISTS `w_token`;
CREATE TABLE `w_token` (
  `t_id` int(10) NOT NULL auto_increment COMMENT '令牌id',
  `t_wfid` int(10) NOT NULL COMMENT '工作流id',
  `t_wfcid` int(10) NOT NULL COMMENT '工作流实例id',
  `t_pid` int(10) NOT NULL COMMENT '所处库所id',
  `t_status` varchar(20) NOT NULL COMMENT '令牌状态；FREE：自由；LOCK：锁定；CONS：消耗；CANS：取消',
  `t_createdate` datetime NOT NULL COMMENT '令牌进入该库的日期',
  `t_canceldate` datetime NOT NULL COMMENT '令牌取消日期',
  `t_consumedate` datetime NOT NULL COMMENT '令牌被事务变迁发射时消耗日期',
  `t_context` text NOT NULL COMMENT '前一个事务变迁传递过来的sql where语句形式，或者是数据库基建。',
  PRIMARY KEY  (`t_id`)
) ENGINE=MyISAM AUTO_INCREMENT=154 DEFAULT CHARSET=utf8 COMMENT='工作流实例进度令牌表';

-- ----------------------------
-- Records of w_token
-- ----------------------------
INSERT INTO w_token VALUES ('42', '7', '10', '1', 'FREE', '2013-03-27 19:51:45', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('43', '7', '10', '9', 'FREE', '2013-03-27 19:53:04', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('44', '7', '11', '1', 'FREE', '2013-03-27 19:59:55', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('45', '7', '12', '1', 'FREE', '2013-03-27 20:00:49', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('47', '15', '14', '25', 'FREE', '2013-03-27 23:53:41', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('48', '15', '15', '25', 'FREE', '2013-03-27 23:58:40', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('49', '15', '16', '25', 'FREE', '2013-03-28 00:02:37', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('50', '15', '17', '25', 'FREE', '2013-03-28 00:06:25', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('51', '15', '18', '25', 'FREE', '2013-03-28 00:10:15', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('52', '15', '19', '25', 'FREE', '2013-03-28 00:13:44', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('53', '15', '20', '25', 'FREE', '2013-03-28 00:16:16', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('54', '15', '21', '25', 'FREE', '2013-03-28 00:18:57', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('55', '15', '22', '25', 'FREE', '2013-03-28 00:20:01', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('56', '15', '23', '25', 'FREE', '2013-03-28 00:22:17', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('57', '15', '24', '25', 'FREE', '2013-03-28 00:24:22', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('58', '15', '25', '25', 'FREE', '2013-03-28 00:26:47', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('59', '15', '26', '25', 'FREE', '2013-03-28 00:28:51', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('60', '15', '27', '25', 'FREE', '2013-03-28 00:30:38', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('61', '15', '28', '25', 'FREE', '2013-03-28 00:33:51', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('62', '15', '29', '25', 'FREE', '2013-03-28 00:36:17', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('63', '15', '30', '25', 'FREE', '2013-03-28 00:38:17', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('64', '15', '31', '25', 'FREE', '2013-03-28 00:39:38', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('65', '15', '32', '25', 'FREE', '2013-03-28 00:40:19', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('66', '15', '33', '25', 'FREE', '2013-03-28 00:42:06', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('67', '15', '34', '25', 'FREE', '2013-03-28 00:44:16', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('68', '15', '35', '25', 'FREE', '2013-03-28 00:46:23', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('69', '15', '36', '25', 'FREE', '2013-03-28 00:51:10', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('70', '15', '37', '25', 'FREE', '2013-03-28 00:54:01', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('71', '15', '38', '25', 'FREE', '2013-03-28 00:55:29', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('72', '15', '39', '25', 'FREE', '2013-03-28 00:56:53', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('73', '15', '40', '25', 'FREE', '2013-03-28 00:58:42', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('74', '15', '41', '25', 'FREE', '2013-03-28 01:00:38', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('75', '15', '42', '25', 'FREE', '2013-03-28 01:02:21', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('76', '15', '43', '25', 'FREE', '2013-03-28 01:06:47', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('77', '15', '44', '25', 'FREE', '2013-03-28 01:08:37', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('78', '15', '45', '25', 'FREE', '2013-03-28 01:11:16', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('79', '15', '45', '28', 'FREE', '2013-03-28 01:13:08', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('80', '15', '44', '28', 'FREE', '2013-03-28 01:13:14', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('81', '15', '43', '28', 'FREE', '2013-03-28 01:13:21', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('82', '15', '42', '28', 'FREE', '2013-03-28 01:13:27', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('83', '15', '41', '28', 'FREE', '2013-03-28 01:13:33', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('84', '15', '40', '28', 'FREE', '2013-03-28 01:13:42', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('85', '15', '39', '28', 'FREE', '2013-03-28 01:13:48', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('86', '15', '38', '28', 'FREE', '2013-03-28 01:13:54', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('87', '15', '37', '28', 'FREE', '2013-03-28 01:14:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('88', '15', '36', '28', 'FREE', '2013-03-28 01:14:07', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('89', '15', '35', '28', 'FREE', '2013-03-28 01:14:18', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('90', '15', '34', '28', 'FREE', '2013-03-28 01:14:24', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('91', '15', '33', '28', 'FREE', '2013-03-28 01:14:31', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('92', '15', '32', '28', 'FREE', '2013-03-28 01:14:37', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('93', '15', '31', '28', 'FREE', '2013-03-28 01:14:43', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('94', '15', '30', '28', 'FREE', '2013-03-28 01:14:50', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('95', '15', '29', '28', 'FREE', '2013-03-28 01:14:57', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('96', '15', '28', '28', 'FREE', '2013-03-28 01:15:04', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('97', '15', '27', '28', 'FREE', '2013-03-28 01:15:11', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('98', '15', '26', '28', 'FREE', '2013-03-28 01:15:19', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('99', '15', '25', '28', 'FREE', '2013-03-28 01:15:26', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('100', '15', '24', '28', 'FREE', '2013-03-28 01:15:34', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('101', '15', '23', '28', 'FREE', '2013-03-28 01:15:40', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('102', '15', '22', '28', 'FREE', '2013-03-28 01:15:46', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('103', '15', '21', '28', 'FREE', '2013-03-28 01:15:52', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('104', '15', '20', '28', 'FREE', '2013-03-28 01:16:05', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('105', '15', '19', '28', 'FREE', '2013-03-28 01:16:11', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('106', '15', '18', '28', 'FREE', '2013-03-28 01:16:17', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('107', '15', '17', '28', 'FREE', '2013-03-28 01:16:45', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('108', '15', '16', '28', 'FREE', '2013-03-28 01:16:50', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('109', '15', '15', '28', 'FREE', '2013-03-28 01:16:56', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('110', '15', '14', '28', 'FREE', '2013-03-28 01:17:01', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('111', '15', '16', '29', 'FREE', '2013-03-28 01:17:54', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('112', '15', '20', '29', 'FREE', '2013-03-28 01:18:28', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('113', '15', '26', '29', 'FREE', '2013-03-28 01:18:38', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('114', '15', '31', '29', 'FREE', '2013-03-28 01:19:07', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('115', '15', '18', '29', 'FREE', '2013-03-28 01:21:29', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('116', '15', '14', '29', 'FREE', '2013-03-28 01:25:10', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('117', '15', '14', '27', 'FREE', '2013-03-28 01:26:11', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('118', '15', '14', '26', 'FREE', '2013-03-28 01:26:56', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('119', '15', '18', '27', 'FREE', '2013-03-28 01:28:13', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('120', '15', '20', '27', 'FREE', '2013-03-30 10:56:42', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('121', '15', '20', '26', 'FREE', '2013-04-01 22:18:19', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('122', '15', '18', '26', 'FREE', '2013-04-01 22:18:33', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('123', '15', '24', '29', 'FREE', '2013-04-02 09:33:26', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('124', '15', '34', '29', 'FREE', '2013-04-02 09:35:29', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('125', '15', '44', '29', 'FREE', '2013-04-02 09:36:08', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('126', '15', '15', '29', 'FREE', '2013-04-02 09:36:55', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('127', '15', '28', '29', 'FREE', '2013-04-02 09:37:11', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('128', '15', '30', '29', 'FREE', '2013-04-02 09:37:24', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('129', '15', '35', '29', 'FREE', '2013-04-02 09:37:37', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('130', '15', '36', '29', 'FREE', '2013-04-02 09:37:46', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('131', '15', '21', '29', 'FREE', '2013-04-02 09:37:51', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('132', '15', '42', '29', 'FREE', '2013-04-02 09:38:22', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('133', '15', '39', '29', 'FREE', '2013-04-02 09:39:53', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('134', '15', '27', '29', 'FREE', '2013-04-02 09:42:37', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('135', '15', '29', '29', 'FREE', '2013-04-02 09:45:36', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('136', '15', '32', '29', 'FREE', '2013-04-02 09:48:15', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('137', '15', '37', '29', 'FREE', '2013-04-02 09:48:50', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('138', '15', '46', '25', 'FREE', '2013-04-02 12:31:58', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');
INSERT INTO w_token VALUES ('139', '15', '46', '28', 'FREE', '2013-04-02 16:00:19', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '');

-- ----------------------------
-- Table structure for `w_tran2form`
-- ----------------------------
DROP TABLE IF EXISTS `w_tran2form`;
CREATE TABLE `w_tran2form` (
  `t2f_id` int(10) NOT NULL auto_increment COMMENT '事物变迁映射业务表单id',
  `t2f_tid` int(10) NOT NULL COMMENT '事物变迁id',
  `t2f_btid` int(10) NOT NULL COMMENT '业务表单模板id',
  PRIMARY KEY  (`t2f_id`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='事物变迁映射业务表单表';

-- ----------------------------
-- Records of w_tran2form
-- ----------------------------
INSERT INTO w_tran2form VALUES ('3', '3', '1');

-- ----------------------------
-- Table structure for `w_tran2role`
-- ----------------------------
DROP TABLE IF EXISTS `w_tran2role`;
CREATE TABLE `w_tran2role` (
  `t2r_id` int(10) NOT NULL auto_increment COMMENT '事务变迁映射角色id',
  `t2r_tid` int(10) NOT NULL COMMENT '事务变迁id',
  `t2r_prid` int(10) NOT NULL COMMENT '角色id',
  PRIMARY KEY  (`t2r_id`)
) ENGINE=MyISAM AUTO_INCREMENT=119 DEFAULT CHARSET=utf8 COMMENT='事务变迁映射角色表';

-- ----------------------------
-- Records of w_tran2role
-- ----------------------------
INSERT INTO w_tran2role VALUES ('33', '6', '5');
INSERT INTO w_tran2role VALUES ('36', '12', '5');
INSERT INTO w_tran2role VALUES ('37', '13', '5');
INSERT INTO w_tran2role VALUES ('75', '7', '11');
INSERT INTO w_tran2role VALUES ('76', '8', '12');
INSERT INTO w_tran2role VALUES ('87', '9', '10');
INSERT INTO w_tran2role VALUES ('94', '15', '12');
INSERT INTO w_tran2role VALUES ('95', '15', '14');
INSERT INTO w_tran2role VALUES ('101', '1', '10');
INSERT INTO w_tran2role VALUES ('102', '2', '16');
INSERT INTO w_tran2role VALUES ('103', '3', '4');
INSERT INTO w_tran2role VALUES ('104', '4', '5');
INSERT INTO w_tran2role VALUES ('108', '14', '11');
INSERT INTO w_tran2role VALUES ('109', '14', '13');
INSERT INTO w_tran2role VALUES ('114', '5', '16');
INSERT INTO w_tran2role VALUES ('113', '5', '10');
INSERT INTO w_tran2role VALUES ('115', '5', '19');
INSERT INTO w_tran2role VALUES ('116', '16', '12');
INSERT INTO w_tran2role VALUES ('117', '16', '14');
INSERT INTO w_tran2role VALUES ('118', '16', '20');

-- ----------------------------
-- Table structure for `w_trancase`
-- ----------------------------
DROP TABLE IF EXISTS `w_trancase`;
CREATE TABLE `w_trancase` (
  `tc_id` int(10) NOT NULL auto_increment COMMENT '事务变迁工作项id',
  `tc_wfid` int(10) NOT NULL COMMENT '工作流id',
  `tc_tid` int(10) NOT NULL COMMENT '事务变迁id',
  `tc_wfcid` int(10) NOT NULL COMMENT '工作流实例id',
  `tc_type` varchar(20) NOT NULL COMMENT '事务变迁触发类型；USER：人工手动触发；AUTO：系统自动触发；MSG：外部消息触发；TIME：时限触发；（只有当变迁的所有输入库都有了令牌，该变迁才能从触发状态发射fire,如果发射成功，该变迁的所有输出库都会生成一个令牌）',
  `tc_firetaskid` int(10) NOT NULL COMMENT '工作项处理后，执行任务id',
  `tc_context` text NOT NULL COMMENT '工作项处理后，要传递给任务的数据库实体的基建，或者是sql where语句形式',
  `tc_status` varchar(20) NOT NULL COMMENT '工作项状态；EN：启用；IP：处理中；CA：取消； FI：完成',
  `tc_enabledate` datetime NOT NULL COMMENT '工作项启用日期',
  `tc_canceldate` datetime NOT NULL COMMENT '工作项取消日期',
  `tc_finishdate` datetime NOT NULL COMMENT '工作项完成日期',
  `tc_limit` int(10) NOT NULL COMMENT '只有当wi_type为TIME时才有效，表示小时数。',
  `tc_puid` int(10) NOT NULL COMMENT '工作项执行者用户id',
  `tc_puname` varchar(50) NOT NULL COMMENT '工作项执行人name',
  `tc_remark` text NOT NULL COMMENT '事务变迁实例备注信息',
  PRIMARY KEY  (`tc_id`)
) ENGINE=MyISAM AUTO_INCREMENT=146 DEFAULT CHARSET=utf8 COMMENT='事务变迁实例';

-- ----------------------------
-- Records of w_trancase
-- ----------------------------
INSERT INTO w_trancase VALUES ('38', '7', '3', '10', 'USER', '0', '', 'FI', '2013-03-27 19:51:45', '0000-00-00 00:00:00', '2013-03-27 19:53:04', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('39', '7', '1', '10', 'USER', '0', '', 'EN', '2013-03-27 19:53:04', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('40', '7', '3', '11', 'USER', '0', '', 'EN', '2013-03-27 19:59:55', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('41', '7', '3', '12', 'USER', '0', '', 'EN', '2013-03-27 20:00:49', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('43', '15', '5', '14', 'USER', '0', '', 'FI', '2013-03-27 23:53:41', '0000-00-00 00:00:00', '2013-03-28 01:17:01', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('44', '15', '5', '15', 'USER', '0', '', 'FI', '2013-03-27 23:58:40', '0000-00-00 00:00:00', '2013-03-28 01:16:56', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('45', '15', '5', '16', 'USER', '0', '', 'FI', '2013-03-28 00:02:37', '0000-00-00 00:00:00', '2013-03-28 01:16:50', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('46', '15', '5', '17', 'USER', '0', '', 'FI', '2013-03-28 00:06:25', '0000-00-00 00:00:00', '2013-03-28 01:16:45', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('47', '15', '5', '18', 'USER', '0', '', 'FI', '2013-03-28 00:10:15', '0000-00-00 00:00:00', '2013-03-28 01:16:17', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('48', '15', '5', '19', 'USER', '0', '', 'FI', '2013-03-28 00:13:44', '0000-00-00 00:00:00', '2013-03-28 01:16:11', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('49', '15', '5', '20', 'USER', '0', '', 'FI', '2013-03-28 00:16:16', '0000-00-00 00:00:00', '2013-03-28 01:16:05', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('50', '15', '5', '21', 'USER', '0', '', 'FI', '2013-03-28 00:18:57', '0000-00-00 00:00:00', '2013-03-28 01:15:52', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('51', '15', '5', '22', 'USER', '0', '', 'FI', '2013-03-28 00:20:01', '0000-00-00 00:00:00', '2013-03-28 01:15:46', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('52', '15', '5', '23', 'USER', '0', '', 'FI', '2013-03-28 00:22:17', '0000-00-00 00:00:00', '2013-03-28 01:15:40', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('53', '15', '5', '24', 'USER', '0', '', 'FI', '2013-03-28 00:24:22', '0000-00-00 00:00:00', '2013-03-28 01:15:34', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('54', '15', '5', '25', 'USER', '0', '', 'FI', '2013-03-28 00:26:47', '0000-00-00 00:00:00', '2013-03-28 01:15:26', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('55', '15', '5', '26', 'USER', '0', '', 'FI', '2013-03-28 00:28:51', '0000-00-00 00:00:00', '2013-03-28 01:15:19', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('56', '15', '5', '27', 'USER', '0', '', 'FI', '2013-03-28 00:30:38', '0000-00-00 00:00:00', '2013-03-28 01:15:11', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('57', '15', '5', '28', 'USER', '0', '', 'FI', '2013-03-28 00:33:51', '0000-00-00 00:00:00', '2013-03-28 01:15:04', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('58', '15', '5', '29', 'USER', '0', '', 'FI', '2013-03-28 00:36:17', '0000-00-00 00:00:00', '2013-03-28 01:14:57', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('59', '15', '5', '30', 'USER', '0', '', 'FI', '2013-03-28 00:38:17', '0000-00-00 00:00:00', '2013-03-28 01:14:50', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('60', '15', '5', '31', 'USER', '0', '', 'FI', '2013-03-28 00:39:38', '0000-00-00 00:00:00', '2013-03-28 01:14:43', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('61', '15', '5', '32', 'USER', '0', '', 'FI', '2013-03-28 00:40:19', '0000-00-00 00:00:00', '2013-03-28 01:14:37', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('62', '15', '5', '33', 'USER', '0', '', 'FI', '2013-03-28 00:42:06', '0000-00-00 00:00:00', '2013-03-28 01:14:31', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('63', '15', '5', '34', 'USER', '0', '', 'FI', '2013-03-28 00:44:16', '0000-00-00 00:00:00', '2013-03-28 01:14:24', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('64', '15', '5', '35', 'USER', '0', '', 'FI', '2013-03-28 00:46:23', '0000-00-00 00:00:00', '2013-03-28 01:14:18', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('65', '15', '5', '36', 'USER', '0', '', 'FI', '2013-03-28 00:51:10', '0000-00-00 00:00:00', '2013-03-28 01:14:07', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('66', '15', '5', '37', 'USER', '0', '', 'FI', '2013-03-28 00:54:01', '0000-00-00 00:00:00', '2013-03-28 01:14:00', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('67', '15', '5', '38', 'USER', '0', '', 'FI', '2013-03-28 00:55:29', '0000-00-00 00:00:00', '2013-03-28 01:13:54', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('68', '15', '5', '39', 'USER', '0', '', 'FI', '2013-03-28 00:56:53', '0000-00-00 00:00:00', '2013-03-28 01:13:48', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('69', '15', '5', '40', 'USER', '0', '', 'FI', '2013-03-28 00:58:42', '0000-00-00 00:00:00', '2013-03-28 01:13:42', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('70', '15', '5', '41', 'USER', '0', '', 'FI', '2013-03-28 01:00:38', '0000-00-00 00:00:00', '2013-03-28 01:13:33', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('71', '15', '5', '42', 'USER', '0', '', 'FI', '2013-03-28 01:02:21', '0000-00-00 00:00:00', '2013-03-28 01:13:27', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('72', '15', '5', '43', 'USER', '0', '', 'FI', '2013-03-28 01:06:47', '0000-00-00 00:00:00', '2013-03-28 01:13:21', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('73', '15', '5', '44', 'USER', '0', '', 'FI', '2013-03-28 01:08:37', '0000-00-00 00:00:00', '2013-03-28 01:13:14', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('74', '15', '5', '45', 'USER', '0', '', 'FI', '2013-03-28 01:11:16', '0000-00-00 00:00:00', '2013-03-28 01:13:08', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('75', '15', '14', '45', 'USER', '0', '', 'IP', '2013-03-28 01:13:08', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('76', '15', '14', '44', 'USER', '0', '', 'FI', '2013-03-28 01:13:14', '0000-00-00 00:00:00', '2013-04-02 09:36:08', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('77', '15', '14', '43', 'USER', '0', '', 'IP', '2013-03-28 01:13:21', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('78', '15', '14', '42', 'USER', '0', '', 'FI', '2013-03-28 01:13:27', '0000-00-00 00:00:00', '2013-04-02 09:38:22', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('79', '15', '14', '41', 'USER', '0', '', 'IP', '2013-03-28 01:13:33', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('80', '15', '14', '40', 'USER', '0', '', 'IP', '2013-03-28 01:13:42', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('81', '15', '14', '39', 'USER', '0', '', 'FI', '2013-03-28 01:13:48', '0000-00-00 00:00:00', '2013-04-02 09:39:53', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('82', '15', '14', '38', 'USER', '0', '', 'IP', '2013-03-28 01:13:54', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('83', '15', '14', '37', 'USER', '0', '', 'FI', '2013-03-28 01:14:00', '0000-00-00 00:00:00', '2013-04-02 09:48:50', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('84', '15', '14', '36', 'USER', '0', '', 'FI', '2013-03-28 01:14:07', '0000-00-00 00:00:00', '2013-04-02 09:37:46', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('85', '15', '14', '35', 'USER', '0', '', 'FI', '2013-03-28 01:14:18', '0000-00-00 00:00:00', '2013-04-02 09:37:37', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('86', '15', '14', '34', 'USER', '0', '', 'FI', '2013-03-28 01:14:24', '0000-00-00 00:00:00', '2013-04-02 09:35:29', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('87', '15', '14', '33', 'USER', '0', '', 'IP', '2013-03-28 01:14:31', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('88', '15', '14', '32', 'USER', '0', '', 'FI', '2013-03-28 01:14:37', '0000-00-00 00:00:00', '2013-04-02 09:48:15', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('89', '15', '14', '31', 'USER', '0', '', 'FI', '2013-03-28 01:14:43', '0000-00-00 00:00:00', '2013-03-28 01:19:07', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('90', '15', '14', '30', 'USER', '0', '', 'FI', '2013-03-28 01:14:50', '0000-00-00 00:00:00', '2013-04-02 09:37:24', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('91', '15', '14', '29', 'USER', '0', '', 'FI', '2013-03-28 01:14:57', '0000-00-00 00:00:00', '2013-04-02 09:45:36', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('92', '15', '14', '28', 'USER', '0', '', 'FI', '2013-03-28 01:15:04', '0000-00-00 00:00:00', '2013-04-02 09:37:11', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('93', '15', '14', '27', 'USER', '0', '', 'FI', '2013-03-28 01:15:11', '0000-00-00 00:00:00', '2013-04-02 09:42:37', '0', '24', '李娜', '所有页面都设计完成  客户没法回传网站确认书  要的急让做程序  都做好后等客服去教他们的时候把确认书盖章后带回来');
INSERT INTO w_trancase VALUES ('94', '15', '14', '26', 'USER', '0', '', 'FI', '2013-03-28 01:15:19', '0000-00-00 00:00:00', '2013-03-28 01:18:38', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('95', '15', '14', '25', 'USER', '0', '', 'IP', '2013-03-28 01:15:26', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('96', '15', '14', '24', 'USER', '0', '', 'FI', '2013-03-28 01:15:34', '0000-00-00 00:00:00', '2013-04-02 09:33:26', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('97', '15', '14', '23', 'USER', '0', '', 'EN', '2013-03-28 01:15:40', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('98', '15', '14', '22', 'USER', '0', '', 'EN', '2013-03-28 01:15:46', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('99', '15', '14', '21', 'USER', '0', '', 'FI', '2013-03-28 01:15:52', '0000-00-00 00:00:00', '2013-04-02 09:37:51', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('100', '15', '14', '20', 'USER', '0', '', 'FI', '2013-03-28 01:16:05', '0000-00-00 00:00:00', '2013-03-28 01:18:28', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('101', '15', '14', '19', 'USER', '0', '', 'IP', '2013-03-28 01:16:11', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('102', '15', '14', '18', 'USER', '0', '', 'FI', '2013-03-28 01:16:17', '0000-00-00 00:00:00', '2013-03-28 01:21:29', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('103', '15', '14', '17', 'USER', '0', '', 'IP', '2013-03-28 01:16:45', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '24', '李娜', '');
INSERT INTO w_trancase VALUES ('104', '15', '14', '16', 'USER', '0', '', 'FI', '2013-03-28 01:16:50', '0000-00-00 00:00:00', '2013-03-28 01:17:54', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('105', '15', '14', '15', 'USER', '0', '', 'FI', '2013-03-28 01:16:56', '0000-00-00 00:00:00', '2013-04-02 09:36:55', '0', '9', '王秀娟', '');
INSERT INTO w_trancase VALUES ('106', '15', '14', '14', 'USER', '0', '', 'FI', '2013-03-28 01:17:01', '0000-00-00 00:00:00', '2013-03-28 01:25:10', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('107', '15', '16', '16', 'USER', '0', '', 'EN', '2013-03-28 01:17:54', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('108', '15', '15', '20', 'USER', '0', '', 'FI', '2013-03-28 01:18:28', '0000-00-00 00:00:00', '2013-03-30 10:56:42', '0', '3', '张凯', '');
INSERT INTO w_trancase VALUES ('109', '15', '16', '26', 'USER', '0', '', 'EN', '2013-03-28 01:18:38', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('110', '15', '16', '31', 'USER', '0', '', 'EN', '2013-03-28 01:19:07', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('111', '15', '15', '18', 'USER', '0', '', 'FI', '2013-03-28 01:21:29', '0000-00-00 00:00:00', '2013-03-28 01:28:13', '0', '25', '冯欣', '');
INSERT INTO w_trancase VALUES ('112', '15', '15', '14', 'USER', '0', '', 'FI', '2013-03-28 01:25:10', '0000-00-00 00:00:00', '2013-03-28 01:26:11', '0', '25', '冯欣', '');
INSERT INTO w_trancase VALUES ('113', '15', '9', '14', 'USER', '0', '', 'FI', '2013-03-28 01:26:11', '0000-00-00 00:00:00', '2013-03-28 01:26:56', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('114', '15', '9', '18', 'USER', '0', '', 'FI', '2013-03-28 01:28:13', '0000-00-00 00:00:00', '2013-04-01 22:18:33', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('115', '15', '9', '20', 'USER', '0', '', 'FI', '2013-03-30 10:56:42', '0000-00-00 00:00:00', '2013-04-01 22:18:19', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('116', '15', '16', '24', 'USER', '0', '', 'EN', '2013-04-02 09:33:26', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('117', '15', '16', '34', 'USER', '0', '', 'EN', '2013-04-02 09:35:29', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('118', '15', '16', '44', 'USER', '0', '', 'EN', '2013-04-02 09:36:08', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('119', '15', '16', '15', 'USER', '0', '', 'EN', '2013-04-02 09:36:55', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('120', '15', '16', '28', 'USER', '0', '', 'EN', '2013-04-02 09:37:11', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('121', '15', '16', '30', 'USER', '0', '', 'EN', '2013-04-02 09:37:24', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('122', '15', '16', '35', 'USER', '0', '', 'EN', '2013-04-02 09:37:37', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('123', '15', '16', '36', 'USER', '0', '', 'EN', '2013-04-02 09:37:46', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('124', '15', '16', '21', 'USER', '0', '', 'EN', '2013-04-02 09:37:51', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('125', '15', '16', '42', 'USER', '0', '', 'EN', '2013-04-02 09:38:22', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('126', '15', '16', '39', 'USER', '0', '', 'EN', '2013-04-02 09:39:53', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('127', '15', '16', '27', 'USER', '0', '', 'EN', '2013-04-02 09:42:37', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('128', '15', '16', '29', 'USER', '0', '', 'EN', '2013-04-02 09:45:36', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('129', '15', '16', '32', 'USER', '0', '', 'EN', '2013-04-02 09:48:15', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('130', '15', '16', '37', 'USER', '0', '', 'EN', '2013-04-02 09:48:50', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '0', '', '');
INSERT INTO w_trancase VALUES ('131', '15', '5', '46', 'USER', '0', '', 'FI', '2013-04-02 12:31:58', '0000-00-00 00:00:00', '2013-04-02 16:00:19', '0', '1', '徐飞', '');
INSERT INTO w_trancase VALUES ('132', '15', '14', '46', 'USER', '0', '', 'IP', '2013-04-02 16:00:19', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0', '9', '王秀娟', '');

-- ----------------------------
-- Table structure for `w_transition`
-- ----------------------------
DROP TABLE IF EXISTS `w_transition`;
CREATE TABLE `w_transition` (
  `t_id` int(10) NOT NULL auto_increment COMMENT '事务变迁id',
  `t_wfid` int(10) NOT NULL COMMENT '工作流id',
  `t_name` varchar(50) NOT NULL COMMENT '事务变迁名称',
  `t_sort` int(10) NOT NULL COMMENT '排序',
  `t_remark` text NOT NULL COMMENT '备注',
  `t_type` varchar(20) NOT NULL COMMENT '事务变迁触发类型；USER：人工手动触发；AUTO：系统自动触发；MSG：外部消息触发；TIME：时限触发；（只有当变迁的所有输入库都有了令牌，该变迁才能从触发状态发射fire,如果发射成功，该变迁的所有输出库都会生成一个令牌）',
  `t_limit` int(10) NOT NULL COMMENT '只有当t_type为TIME时才有效，表示小时数。',
  `t_firetaskid` int(10) NOT NULL COMMENT '事务变迁发射fire时，需要执行的任务id；若该任务id是一个工作流的开始任务，不能被任何变迁使用执行，因为这会导致另一个工作流实例产生，有可能会变成死循环。',
  `t_rolename` text NOT NULL COMMENT '事务变迁映射角色',
  `t_formname` text NOT NULL COMMENT '事务变迁映射表单',
  PRIMARY KEY  (`t_id`)
) ENGINE=MyISAM AUTO_INCREMENT=17 DEFAULT CHARSET=utf8 COMMENT='工作流事务变迁节点表';

-- ----------------------------
-- Records of w_transition
-- ----------------------------
INSERT INTO w_transition VALUES ('1', '7', '部门总监审核', '5', '', 'USER', '0', '0', '技术总监,', '');
INSERT INTO w_transition VALUES ('2', '7', '总经理确定', '10', '', 'USER', '0', '0', '总经理,', '');
INSERT INTO w_transition VALUES ('3', '7', '创建假事单', '0', '', 'USER', '0', '0', '员工,', '请假单,');
INSERT INTO w_transition VALUES ('4', '11', '创建KPI表', '1', '', 'USER', '0', '0', '超级管理员,', '');
INSERT INTO w_transition VALUES ('5', '15', '填写企业建站单', '0', '', 'USER', '0', '0', '技术总监,总经理,财务总监,', '');
INSERT INTO w_transition VALUES ('6', '14', '创建网站Bug维护单', '0', '', 'USER', '0', '0', '超级管理员,', '');
INSERT INTO w_transition VALUES ('9', '15', '技术总监审核', '30', '', 'USER', '0', '0', '技术总监,', '');
INSERT INTO w_transition VALUES ('12', '17', '创建商派产品订单', '0', '', 'USER', '0', '0', '超级管理员,', '');
INSERT INTO w_transition VALUES ('13', '16', '创建SEO订单', '0', '', 'USER', '0', '0', '超级管理员,', '');
INSERT INTO w_transition VALUES ('14', '15', '网页设计', '5', '', 'USER', '0', '0', '首席设计师,设计师,', '');
INSERT INTO w_transition VALUES ('15', '15', '编写程序', '15', '', 'USER', '0', '0', '高级软件工程师,软件工程师,', '');
INSERT INTO w_transition VALUES ('16', '15', '切片', '8', '', 'USER', '0', '0', '高级软件工程师,软件工程师,切片师,', '');

-- ----------------------------
-- Table structure for `w_workflow`
-- ----------------------------
DROP TABLE IF EXISTS `w_workflow`;
CREATE TABLE `w_workflow` (
  `wf_id` int(10) NOT NULL auto_increment COMMENT '工作流id',
  `wf_wftid` int(10) NOT NULL COMMENT '工作流类型id',
  `wf_name` varchar(50) NOT NULL COMMENT '工作流名称',
  `wf_sort` int(10) NOT NULL COMMENT '排序',
  `wf_icon` text NOT NULL COMMENT '工作流图标',
  `wf_remark` text NOT NULL COMMENT '备注',
  `wf_starttaskid` int(10) NOT NULL COMMENT '启动工作流时，执行任务id（并在开始库放置令牌）',
  `wf_isrun` tinyint(1) NOT NULL COMMENT '工作流是否启用，默认为false（工作流完整性需要检验）',
  `wf_date` datetime NOT NULL COMMENT '工作流创建日期',
  `wf_user` varchar(50) NOT NULL COMMENT '工作流创建者',
  `wf_editdate` datetime NOT NULL COMMENT '最近一次变更日期',
  `wf_edituser` varchar(50) NOT NULL COMMENT '最近一次变更者',
  `wf_btid` int(10) NOT NULL COMMENT '工作流映射主表单模板id',
  `wf_btname` varchar(50) NOT NULL COMMENT '工作流映射主表单模板名称',
  PRIMARY KEY  (`wf_id`)
) ENGINE=MyISAM AUTO_INCREMENT=18 DEFAULT CHARSET=utf8 COMMENT='工作流表';

-- ----------------------------
-- Records of w_workflow
-- ----------------------------
INSERT INTO w_workflow VALUES ('7', '2', '员工假事', '0', '', '<img src=\\\"\\\\&quot;/plugin/kindeditor/attached/image/20130305/20130305115448_98324.jpg\\\\&quot;\\\" alt=\\\"\\\\&quot;\\\\&quot;\\\" />', '0', '0', '2013-03-08 23:47:33', '徐飞', '2013-04-06 22:04:30', '徐飞', '1', '请假单');
INSERT INTO w_workflow VALUES ('11', '2', '员工KPI考评审核流程 ', '0', '', '', '0', '1', '2013-02-15 01:56:42', '徐飞', '2013-03-27 20:55:02', '徐飞', '0', '');
INSERT INTO w_workflow VALUES ('12', '5', '客户关系管理', '0', '', '', '0', '0', '2013-02-24 20:50:06', '徐飞', '0000-00-00 00:00:00', '', '0', '');
INSERT INTO w_workflow VALUES ('13', '5', '订单管理', '0', '', '', '0', '0', '2013-02-24 20:50:21', '徐飞', '0000-00-00 00:00:00', '', '0', '');
INSERT INTO w_workflow VALUES ('14', '3', '网站Bug修复', '5', '/uploads/workflowico/14.png', '', '0', '1', '2013-03-08 23:45:12', '徐飞', '2013-03-27 20:58:18', '徐飞', '0', '');
INSERT INTO w_workflow VALUES ('15', '3', '企业建站', '1', '/uploads/workflowico/15.png', '', '0', '1', '2013-03-08 23:47:33', '徐飞', '2013-03-09 20:21:13', '徐飞', '2', '企业网建业务单');
INSERT INTO w_workflow VALUES ('16', '4', 'SEO优化', '0', '', '', '0', '0', '2013-03-10 15:32:14', '徐飞', '0000-00-00 00:00:00', '', '0', '');
INSERT INTO w_workflow VALUES ('17', '3', '商派直销动力', '10', '/uploads/workflowico/17.jpg', '', '0', '1', '2013-03-10 15:34:20', '徐飞', '2013-03-27 20:58:21', '徐飞', '0', '');

-- ----------------------------
-- Table structure for `w_workflow2role`
-- ----------------------------
DROP TABLE IF EXISTS `w_workflow2role`;
CREATE TABLE `w_workflow2role` (
  `wf2r_id` int(10) NOT NULL auto_increment COMMENT '工作流关联角色信息id',
  `wf2r_type` varchar(20) NOT NULL COMMENT '操作权限类型(NEW:创建表单权限；ASSIGN:分单权限；DELETE:删除工作流实例操作)',
  `wf2r_wfid` int(10) NOT NULL COMMENT '工作流id',
  `wf2r_prid` int(10) NOT NULL COMMENT '角色id',
  PRIMARY KEY  (`wf2r_id`)
) ENGINE=MyISAM AUTO_INCREMENT=67 DEFAULT CHARSET=utf8 COMMENT='工作流关联角色操作权限表';

-- ----------------------------
-- Records of w_workflow2role
-- ----------------------------
INSERT INTO w_workflow2role VALUES ('43', 'NEW', '15', '10');
INSERT INTO w_workflow2role VALUES ('44', 'NEW', '15', '11');
INSERT INTO w_workflow2role VALUES ('45', 'NEW', '15', '12');
INSERT INTO w_workflow2role VALUES ('49', 'DELETE', '15', '10');
INSERT INTO w_workflow2role VALUES ('53', 'NEW', '7', '4');
INSERT INTO w_workflow2role VALUES ('54', 'DELETE', '7', '5');
INSERT INTO w_workflow2role VALUES ('55', 'ASSIGN', '7', '5');
INSERT INTO w_workflow2role VALUES ('56', 'NEW', '11', '5');
INSERT INTO w_workflow2role VALUES ('65', 'ASSIGN', '15', '16');
INSERT INTO w_workflow2role VALUES ('64', 'ASSIGN', '15', '12');
INSERT INTO w_workflow2role VALUES ('63', 'ASSIGN', '15', '11');
INSERT INTO w_workflow2role VALUES ('62', 'ASSIGN', '15', '10');
INSERT INTO w_workflow2role VALUES ('66', 'ASSIGN', '15', '19');

-- ----------------------------
-- Table structure for `w_workflowcase`
-- ----------------------------
DROP TABLE IF EXISTS `w_workflowcase`;
CREATE TABLE `w_workflowcase` (
  `wfc_id` int(10) NOT NULL auto_increment COMMENT '工作流实例id',
  `wfc_wfid` int(10) NOT NULL COMMENT '工作流id',
  `wfc_status` varchar(20) NOT NULL COMMENT '工作流实例当前状态；OP：开放；CL：关闭；SU：挂起；CA：取消；',
  `wfc_startdate` datetime NOT NULL COMMENT '工作流实例启动日期',
  `wfc_enddate` datetime NOT NULL COMMENT '工作流实例关闭日期（令牌放入结束库时）',
  `wfc_context` text NOT NULL COMMENT 'sql where语句形式的，或者是数据库基建。这个由对应工作流的启动任务id（w_starttaskid）产生的',
  PRIMARY KEY  (`wfc_id`)
) ENGINE=MyISAM AUTO_INCREMENT=50 DEFAULT CHARSET=utf8 COMMENT='工作流实例表';

-- ----------------------------
-- Records of w_workflowcase
-- ----------------------------
INSERT INTO w_workflowcase VALUES ('10', '7', 'OP', '2013-03-27 19:51:45', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('11', '7', 'OP', '2013-03-27 19:59:55', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('12', '7', 'OP', '2013-03-27 20:00:49', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('14', '15', 'OP', '2013-03-27 23:53:41', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('15', '15', 'OP', '2013-03-27 23:58:40', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('16', '15', 'OP', '2013-03-28 00:02:37', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('17', '15', 'OP', '2013-03-28 00:06:25', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('18', '15', 'OP', '2013-03-28 00:10:15', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('19', '15', 'OP', '2013-03-28 00:13:44', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('20', '15', 'OP', '2013-03-28 00:16:16', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('21', '15', 'OP', '2013-03-28 00:18:57', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('22', '15', 'OP', '2013-03-28 00:20:01', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('23', '15', 'OP', '2013-03-28 00:22:17', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('24', '15', 'OP', '2013-03-28 00:24:22', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('25', '15', 'OP', '2013-03-28 00:26:47', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('26', '15', 'OP', '2013-03-28 00:28:51', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('27', '15', 'OP', '2013-03-28 00:30:38', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('28', '15', 'OP', '2013-03-28 00:33:51', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('29', '15', 'OP', '2013-03-28 00:36:17', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('30', '15', 'OP', '2013-03-28 00:38:17', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('31', '15', 'OP', '2013-03-28 00:39:38', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('32', '15', 'OP', '2013-03-28 00:40:19', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('33', '15', 'OP', '2013-03-28 00:42:06', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('34', '15', 'OP', '2013-03-28 00:44:16', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('35', '15', 'OP', '2013-03-28 00:46:23', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('36', '15', 'OP', '2013-03-28 00:51:10', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('37', '15', 'OP', '2013-03-28 00:54:01', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('38', '15', 'OP', '2013-03-28 00:55:29', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('39', '15', 'OP', '2013-03-28 00:56:53', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('40', '15', 'OP', '2013-03-28 00:58:42', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('41', '15', 'OP', '2013-03-28 01:00:38', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('42', '15', 'OP', '2013-03-28 01:02:21', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('43', '15', 'OP', '2013-03-28 01:06:47', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('44', '15', 'OP', '2013-03-28 01:08:37', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('45', '15', 'OP', '2013-03-28 01:11:16', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowcase VALUES ('46', '15', 'OP', '2013-04-02 12:31:58', '0000-00-00 00:00:00', '');

-- ----------------------------
-- Table structure for `w_workflowtype`
-- ----------------------------
DROP TABLE IF EXISTS `w_workflowtype`;
CREATE TABLE `w_workflowtype` (
  `wft_id` int(10) NOT NULL auto_increment COMMENT '工作流分类id',
  `wft_pid` int(10) NOT NULL COMMENT '工作流分类父id',
  `wft_name` varchar(50) NOT NULL COMMENT '工作流分类名称',
  `wft_sort` int(10) NOT NULL COMMENT '排序',
  `wft_date` datetime NOT NULL COMMENT '创建日期',
  `wft_remark` text NOT NULL COMMENT '备注',
  PRIMARY KEY  (`wft_id`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COMMENT='工作流分类表';

-- ----------------------------
-- Records of w_workflowtype
-- ----------------------------
INSERT INTO w_workflowtype VALUES ('1', '-1', '成都网联天下（工作流）', '0', '2013-02-14 18:44:28', '');
INSERT INTO w_workflowtype VALUES ('2', '1', '人事部工作流', '50', '2013-02-14 00:00:00', '');
INSERT INTO w_workflowtype VALUES ('3', '1', '技术部工作流', '20', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowtype VALUES ('4', '1', '客服部工作流', '10', '0000-00-00 00:00:00', '');
INSERT INTO w_workflowtype VALUES ('5', '1', '市场部工作流', '1', '0000-00-00 00:00:00', '');
